---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricWireType.CreateDefaultFabricWireType(Autodesk.Revit.DB.Document)
source: html/db478856-bbe3-5579-6b04-35f2c29615eb.htm
---
# Autodesk.Revit.DB.Structure.FabricWireType.CreateDefaultFabricWireType Method

Creates a new FabricWireType object with a default name.

## Syntax (C#)
```csharp
public static ElementId CreateDefaultFabricWireType(
	Document ADoc
)
```

## Parameters
- **ADoc** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The newly created type id.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null